const express = require("express");
const app = express();
const port = process.env.PORT || 9000;
const cors = require("cors");

const fullname = "Hello API ,Anchana Srichamnong";
//  data
const products = [
  {
    id: "1",
    name: "มัสมั่นไก่ Chicken Massaman Curry",
    description: "เปิดตัวกันแบบสุดปังกับแชมป์อาหารจานเด็ดที่สุดในโลกของปี พ.ศ.2564 จากเว็บไซต์ CNN Travel กับเมนู “มัสมั่นไก่” อาหารไทยที่ได้ชื่อว่าเป็นราชาแห่งแกงกะหรี่ ด้วยความเผ็ดร้อนของพริกแกงมัสมั่น ผสานความหอมมันของกะทิที่เคี่ยวให้เข้ากันอย่างลงตัว มาพร้อมกับความหนึบของมันฝรั่ง และความนุ่มของน่องไก่ที่ตุ๋นเข้ากันจนได้ที่ ทานคู่กับข้าวสวยร้อนๆ สักจาน อร่อยติดใจคนทั่วโลกได้อย่างไม่ยากอย่างแน่นอนค่ะ",
    cover: "https://static.wixstatic.com/media/c8a905_e3c8602e6e0147ca8b4a81b3f25c5800~mv2.jpg/v1/fill/w_536,h_357,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/c8a905_e3c8602e6e0147ca8b4a81b3f25c5800~mv2.jpg"
  },
  {
    id: "2",
    name: "ต้มยำกุ้ง Tom Yum Kung",
    description: "ปังอย่างต่อเนื่องกับต้มยำกุ้ง เมนูอาหารไทยติดอันดับ Top 10 อาหารจานเด็ดที่สุดในโลกจาก CNN Travel เช่นกัน ซึ่งความเด็ดของเมนูต้มยำกุ้งอยู่ตรงที่พริกอร่อยแซ่บซี้ดสะใจคนทานอาหารรสจัดจ้านเป็นอย่างยิ่ง ตามมาด้วยรสเปรี้ยวของน้ำมะนาว รสเค็มของน้ำปลา รวม 3 รสชาติให้เข้ากันอย่างกลมกล่อม ยิ่งอบอวลไปด้วยกลิ่นหอมของพืชสมุนไพรนานาชนิดแล้วนั้นไม่ให้ใครติดใจยังไงไหวใช่ไหมคะ",
    cover: "https://static.wixstatic.com/media/c8a905_fe934c09b1d54fe0901a278515d7dd09~mv2.jpg/v1/fill/w_536,h_357,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/c8a905_fe934c09b1d54fe0901a278515d7dd09~mv2.jpg"
  },
  {
    id: "3",
    name: "แกงเขียวหวาน Green Curry",
    description: "อีกหนึ่งเมนูแกงรสเด็ดของไทยที่มีมาตั้งแต่ในสมัยโบราณอย่างแกงเขียวหวาน อันอบอวลไปด้วยพริกแกงเขียวหวานสุดเข้มข้นผสานกับกะทิที่เคี่ยวรวมกันให้แตกมัน จากนั้นเติมเนื้อสัตว์ ตามด้วยผักที่เป็นซิกเนเจอร์ของแกงเขียวหวานอย่างใบมะกรูด มะเขือเปราะ มะเขือพวง พริกชี้ฟ้าแดง และใบโหระพา ต้มจนเดือดจนกว่าเข้าที่ค่อยจัดเสิร์ฟทานคู่กับข้าวสวยร้อนๆ ก็เข้ากันดี หรือทานกับขนมจีนก็ฟินสุดใจ ไม่ว่าจะทานแบบไหนก็อร่อยถูกใจคนทั่วโลกได้อย่างไม่ยากเลยค่ะ",
    cover: "https://static.wixstatic.com/media/c8a905_a7c99d53e38545bbb372090f709ef44c~mv2.jpg/v1/fill/w_536,h_357,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/c8a905_a7c99d53e38545bbb372090f709ef44c~mv2.jpg"
  },
  {
    id: "4",
    name: "ผัดไทย Pad  Thai",
    description: "ตำนานสตรีทฟู้ดเมืองไทยต้องยกให้จานนี้เลย! กับผัดไทย ก๋วยเตี๋ยวเส้นจันท์ผัดกับซอสรสเปรี้ยวนำหวานตามทำจากมะขามเปียก เพิ่มสัมผัสกรุบให้กับอาหารด้วยไชโป๊วและเต้าหู้ จากนั้นใส่ผักอย่างถั่วงอกและกุ้ยช่าย คลุกเคล้าให้เข้ากัน ก่อนปิดท้ายด้วยตอกไข่ไก่แล้วยีให้พอแตกก่อนจะคลุกเคล้าอีกครั้ง แล้วตักใส่จานเสิร์ฟคู่กับเครื่องปรุงพริกน้ำตาลมะนาว และผักเคียงอย่างถั่วงอกดิบ กุ้ยช่าย และหัวปลี อร่อยฟินแบบไทยๆ ได้ทุกหัวมุมเมืองตามตรอกซอกซอยค่ะ",
    cover: "https://static.wixstatic.com/media/c8a905_13c6ce2f2429470d804ac61f642cde91~mv2.jpg/v1/fill/w_536,h_357,al_c,q_80,usm_0.66_1.00_0.01,enc_auto/c8a905_13c6ce2f2429470d804ac61f642cde91~mv2.jpg"
  }
];

app.use(express.json(), cors());
// app.use(cors());

app.get("/", (req, res) => {
  res.json({ message: fullname });
});

app.get("/products", (req, res) => {
  res.json(products);
});

app.get("/products/:id", (req, res) => {
  const { id } = req.params;
  const result = products.find((product) => product.id === id);
  res.json(result);
});

app.listen(port, () => {
  console.log("Application is running on port 9000");
});
